In [567]:
import pandas as pd

In [568]:
df= pd.read_excel("data-raw/nyc.xlsx")
df

       Period  Value
0    Jan-2016  17453
1    Feb-2016  16828
2    Mar-2016  16547
3    Apr-2016  17066
4    May-2016  18114
..        ...    ...
107  Dec-2024  25669
108  Jan-2025  21497
109  Feb-2025  23729
110  Mar-2025  24716
111  Apr-2025  24699

[112 rows x 2 columns]

In [569]:
## reformatting the dataframe
pd.options.display.float_format = '{:,.0f}'.format

In [570]:
## understand data better
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112 entries, 0 to 111
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Period  112 non-null    object
 1   Value   112 non-null    int64
dtypes: int64(1), object(1)
memory usage: 1.9+ KB

In [571]:
## summary of dataset and description of distribution
df.describe()

       Value
count    112
mean  21,792
std    3,898
min   12,122
25%   18,634
50%   22,447
75%   25,106
max   29,776

## CLEANING DATA

In [573]:
## one-based indexing so the data starts at 1, not 0. I used Anaconda for this because I couldn't figure out how to do it in the notes.
business_applications = df.reset_index(drop=True).rename(index=lambda x: x + 1)
business_applications

       Period  Value
1    Jan-2016  17453
2    Feb-2016  16828
3    Mar-2016  16547
4    Apr-2016  17066
5    May-2016  18114
..        ...    ...
108  Dec-2024  25669
109  Jan-2025  21497
110  Feb-2025  23729
111  Mar-2025  24716
112  Apr-2025  24699

[112 rows x 2 columns]

In [574]:
# Convert the 'Period' column to datetime using pandas so it registers the column as a date, not a string
business_applications['Period'] = pd.to_datetime(business_applications['Period'], format='%b-%Y')

In [575]:
# sort values in descending order by period
# i need to figure out why this is skipping rows. i don't want it to. Maybe it is because of the month-year format. 
business_applications.sort_values(by= "Period", ascending= False)

        Period  Value
112 2025-04-01  24699
111 2025-03-01  24716
110 2025-02-01  23729
109 2025-01-01  21497
108 2024-12-01  25669
..         ...    ...
5   2016-05-01  18114
4   2016-04-01  17066
3   2016-03-01  16547
2   2016-02-01  16828
1   2016-01-01  17453

[112 rows x 2 columns]

In [576]:
#find YOY percentage change of business applications in NYC from April 2025 to April 2024
# df.Period

In [577]:
## find YOY percentage change of business applications in NYC from March 2025 to March 2024

In [578]:
# business_applications=df.Period.iat[0]

In [579]:
# business_applications

In [580]:

# df['Period'] = pd.to_datetime(df['Period'], format='%b-%Y')

In [581]:
# df = df.sort_values(by= "Period", ascending= False)
# df.head(10)

In [582]:
# df['Percent_Change'] = df['Value'].pct_change() * 100